septa/app/controllers/csv_controller.rb

SELECT * FROM "trips" WHERE ("trips"."block_id" = '422')
---
def test
@array = Trip.find_all_by_block_id("422")

INSERT INTO "trips" ("trip_id", "created_at", "trip_headsign", "updated_at", "block_id", "service_id", "shape_id", "trip_short_name", "route_id") VALUES(' trip_headsign', '2010-09-18 16:44:42', ' block_id', '2010-09-18 16:44:42', 0, ' trip_id', NULL, 0, ' service_id')
---
   def import
     @parsed_file=CSV::Reader.parse(params[:dump][:file])
     n=0
     @parsed_file.each  do |row|
     c=Trip.new
     c.route_id=row[0]
     c.service_id=row[1]
     c.trip_id=row[2]
     c.trip_headsign=row[3]
     c.block_id=row[4]
     c.trip_short_name=row[5]
     c.shape_id=row[6]
     if c.save